app/Http/Controllers/PlayerController.php

    public function list() {
        $arPlayer = User::all();
        foreach(Team::all() as $team) $arTeam[$team->id] = $team['name'];
---
select * from `users`
select * from `teams`

    public function item(User $player) {
        $team = Team::find($player->team_id);
---
select * from `teams` where `teams`.`id` = 1 limit 1