app/Http/Controllers/RegisterController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test4', 'test4@test.ru', '$2y$10$n8bRL0P45EjBymSrRLr/i.SQ1OuKL0UkDs33uc0.ISlEXrW1J26U.', '2022-07-20 18:25:44', '2022-07-20 18:25:44')
---
    public function save(Request $request) {
        if(Auth::check()) {
            return redirect(route('user.private'));
        }
        $validateFields = $request->validate([
            'name' => 'required',
            'email' => 'required|email',
            'password' => 'required'
        ]);

        if(user::where('email', $validateFields['email'])->exists()) {
            return redirect(route('user.reg'))->withErrors([
                'email' => 'Пользователь уже существует'
            ]);
        }

        $user = User::create($validateFields);