app/Http/Controllers/TeamController.php

    public function item(Team $team) {
        //$team = Team::find($team)->first();
        $arPlayer = User::query()->where('team_id', $team->id)->get();
---
select * from `users` where `team_id` = 2